print("""Настав час важкого вибору.
Одного з найважчих виборів у твоєму житті. Готовий?""")

choice = input('>>> ')

if choice == 'yes' or choice =='Yes' or choice == "Yeah":
    print("""Тоді вперед! Сьогодні твій вибір буде вирішувати власну долю 
    і копкаже, наскільки ти син своєї Батьківщини. То хто був кращий?""")
    print('1. Чорновіл')
    print('2. Бандера')
    print('3. Ющенко')
    print('4. Зеленський')
    print('5. Янукович')

    president = input('>>> ')

    if president == '1' or president == '2' or president == '3':
        print('Знаєш толк... Перший рівень пройдено. Але не розслабляйся.')
        print('Час другого раунду. Що смачніше твоїй душі?')
        print('1. Вареники з вишнями (чи капустою).')
        print('2. Паляничка з сиром')
        print('3. Сало')

        food = input('>>> ')

        if food == '1' or food == '2':
            print('Маєш файний смак, ти пройшов ідентифікацію на українця :-)')
        else:
            print('Відчуваю, дуриш мене -_-...')
            print('Останнє контрольне питання. Що для тебе червоне і чорне?')
            print('1. Прапор ОУН/УПА')
            print('2. Божья коровка и флаг НАЦИСТОВ!!!')

            color = input('>>> ')

            if color == '1':
                print("""Перепрошую, щановний націоналісте і патріот своєї країни.
                Час нині неспокійний, треба було впевнитися, що ви чистої душі
                козак і син славетного народу. Слава Україні!""")
                print("1. Героям Слава!")
                print('2. Єта чьто???')

                anthem = input('>>> ')

                if anthem == '1':
                    print(' <3 ')
                else:
                    print('Ага, попався! СБУ вже ніжно стукає у двері :-)')
            else:
                print('Москаляку на гіляку!!!')
    elif president == '4':
        print('Ну молодчинка, гордість матері й батька!')
    elif president == '5':
        print('...на москву біжи, бо СБУ вже близько -_-')
else:
    print('Ну тоді йди далі коровам хвости крутити.\n'
          'Я до тебе по хорошому, а ти мені видєлуєшся.')